package com.pokhara.lekhnath.Chater;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.MenuItem;

import com.pokhara.lekhnath.R;

import java.util.ArrayList;

public class ByaparActivity extends AppCompatActivity {


    private ArrayList<ExampleItem> mExampleList;

    private RecyclerView mRecyclerView;
    private ExampleAdapter mAdapter;
    private RecyclerView.LayoutManager mLayoutManager;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_byapar);
        setTitle(R.string.baypar);

        if(getSupportActionBar()!=null){
            getSupportActionBar().setDisplayHomeAsUpEnabled(true);;
            getSupportActionBar().setDisplayShowHomeEnabled(true);
        }
        createExampleList();
        buildRecyclerView();

    }
    public void createExampleList() {
        mExampleList = new ArrayList<>();

        mExampleList.add(new ExampleItem(R.drawable.nepal, "नया व्यवसाय दर्ता ", "१)निवेदन पत्र \n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि \n" +
                "३) बिदेशीको हकमा राहादानिको प्रमाणित प्रतिलिपि वा सम्बन्धित दुतावासको निजको परिचय खुल्ने सिफारिस \n" +
                "४) २ प्रति फोटो \n" +
                "५) घर बहाल सम्झौता \n" +
                "६) आफ्नै घर टहरा भए चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "७) स्थानीय तहको नाममा दर्ता नगरी प्यान वा अन्य निकायमा दर्ता गरि व्यवसाय दर्ता गरेको हकमा प्यान दर्ता वा अन्य निकायबाट जारि गरेको व्यसाय प्रमाणपत्रको प्रतिलिपि \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "५) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "किसिम प्रकृति र पुंजी अनुसार फरक फरक "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "ब्यवासाय नवीकरण ", "१)निवेदन पत्र \n" +
                "२)नागरिकता प्रमाणपत्रको प्रमाणित प्रतिलिपि \n" +
                "३) स्थानीय तहबाट दर्ता भएको व्यवसाय दर्ताको प्रमाणपत्रको प्रमाणित प्रतिलिपि \n" +
                "४) बहाल सम्झौताको प्रतिलिपि \n" +
                "५) आफ्नै घर टहरा भए चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "५) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "मुल्यांकन पछी जारि गरिएको बिजक अनुकार किसिम ,प्रकृति र पुंजी अनुसार फरक फरक "));

        mExampleList.add(new ExampleItem(R.drawable.nepal, "व्यवसाय बन्द सिफारिस ", "१)व्यवसाय संचालन नभएको विस्तृत व्यहोरा सहितको निवेदन पत्र \n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "३)  चालु आ.व. सम्मको व्यवसाय नविकरण गरेको प्रमाणपत्र \n" +
                "४) घरबहाल सम्झौता पत्रको प्रतिलिपि \n" +
                "५)स्थलगत प्रतिवेदन\n" +
                "६) विदेशीको हकमा परिचय खुल्ने कागजात वा सम्बन्धित दुतावासको पत्र \n" +
                "७) आफ्नै घर भएमा चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात  \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "व्यवसाय संचालन नभएको सिफारिस", "१) व्यवसाय  संचालन नभएको कारण सहितको निवेदन पत्र \n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "३) स्थानीय तहको नाममा व्यवसाय दर्ता गरेको प्रमाणपत्र \n" +
                "४) आफ्नै घर भएमा चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "५) घरबहाल सम्झौता पत्रको प्रतिलिपि \n" +
                "६)स्थलगत प्रतिवेदन \n" +
                "७) सर्जमिन मुचुल्का आवशेक परेमा सो समेत  \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "ब्यापार व्यवसाय नभएको सिफारिस  ", "१) कारण सहितको निवेदन पत्र \n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "३) स्थानीय तहको नाममा व्यवसाय दर्ता गरेको प्रमाणपत्र \n" +
                "४) आफ्नै घर भएमा चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "५) सर्जमिन मुचुल्का आवशेक परेमा सो समेत  \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "व्यवसाय दर्ता सिफारिस ", "१) निवेदन पत्र \n" +
                "२) व्यवसाय  दर्ताको प्रमाणपत्रको  प्रतिलिपि  \n" +
                "३)आफ्नै घर भए चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "४) बहालमा भए सम्झौता पत्र को प्रतिलिपि \n" +
                "५) दुई प्रति पासपोर्ट साइज फोटो \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "५) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "उद्योग ठाउँसारी सिफारिस  ", "१)उद्योग ठाउ सारीको लागि निवेदन  \n" +
                "२) उद्योग दर्ता प्रमाणपत्रको प्रतिलिपी \n" +
                "३) स्थानीय तहको नामको नविकरण सहितको व्यवसाय दर्ता  प्रमाण पत्र \n" +
                "४)चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "५) बहालमा भए सम्झौता पत्र को प्रतिलिपि र बहाल कर तिरेको रसिद नतिरेको भए तिर्न बुझाउन पर्ने \n" +
                "६) (स्थानीय तहको नाम ) क्षेत्र भित्र सारी जाने भए सो वडा कार्यालयको अनुमतिको सिफारिस पत्र \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको १)बुवा आमाको  नागरिकता प्रमाणपत्रको प्रतिलिपि र निवेदन पत्र \n" +
                "२) जन्म दर्ताको प्रमाणपत्र \n" +
                "३)चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "\n" +
                "कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु.५००"));

        // mExampleList.add(new ExampleItem(R.drawable.nepal, "Line1", "Line2","Line3","line4"));

    }

    public void buildRecyclerView() {
        mRecyclerView = findViewById(R.id.recyclerView);
        mRecyclerView.setHasFixedSize(true);
        mLayoutManager = new LinearLayoutManager(this);
        mAdapter = new ExampleAdapter(mExampleList);

        mRecyclerView.setLayoutManager(mLayoutManager);
        mRecyclerView.setAdapter(mAdapter);

        mAdapter.setOnItemClickListener(new ExampleAdapter.OnItemClickListener() {
            @Override
            public void onItemClick(int position) {
                Intent intent = new Intent(ByaparActivity.this, DetailsChater.class);
                intent.putExtra("Example Item", mExampleList.get(position));

                startActivity(intent);
            }
        });
    }
    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        if (item.getItemId()==android.R.id.home);
        finish();
        return super.onOptionsItemSelected(item);
    }
}

