package com.pokhara.lekhnath.Chater;

import android.content.Intent;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.MenuItem;

import com.pokhara.lekhnath.R;

import java.util.ArrayList;


public class PradigitActivity extends AppCompatActivity {



    private ArrayList<ExampleItem> mExampleList;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_pradigit);
        setTitle(R.string.pramadit);
        if(getSupportActionBar()!=null){
            getSupportActionBar().setDisplayHomeAsUpEnabled(true);
            getSupportActionBar().setDisplayShowHomeEnabled(true);
        }
        createExampleList();
        buildRecyclerView();

    }
    public void createExampleList() {
        mExampleList = new ArrayList<>();

        mExampleList.add(new ExampleItem(R.drawable.nepal, "आर्थिक अवस्था बलियो या सम्पन्नता प्रमाणित ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" +
                "३) आयश्रोत भए आयश्रोत खुल्ने कागजात \n" +
                "४) अन्य आवश्यक कागजात \n" +
                "५) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "६) सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रकम नतोकिएकोमा \n" +
                "रु. ५००-\n" +
                "तोकिएकोमा  प्रति\n" +
                "हजार रु. १ "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "आर्थिक अवस्था कमजोर या विपन्नता प्रमाणित ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) आर्थिक अवस्था कमजोर भएको पुष्टि हुने कागजात \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "नि:शुल्क "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जीवित संगको नाता प्रमाणित ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) नाता खुल्ने प्रमाणपत्रको प्रतिलिपि \n" +
                "३) पासपोर्ट साइजको फोटो २  प्रति \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "५) सर्जमिन गरि बुझ्नु पर्ने भए साक्षि बस्ने ७ जनाको नागरिकता प्रमाणपत्रको प्रतिलिपि \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "फोटो राखेर अंग्रेजीमा रु. ६००-\n" +
                "फोटो नराखी रु. ४००- \n" +
                "नेपालीमा रु. ३००- "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "मृतक संगको नाता प्रमाणित ", "१)निवेदन पत्र र नाता खुल्ने  प्रमाणपत्रको प्रतिलिपि\n" +
                "२) हकदारको नागरिकता  प्रमाणपत्रको प्रतिलिपि \n" +
                "३) मृत्यु दर्ता प्रमाणपत्रको प्रिलिपि \n" +
                "४) मृतकको नागरिकता  प्रमाणपत्रको प्रतिलिपि \n" +
                "५) हकवाला नाबालक भए जन्मदर्ता प्रमाणपत्रको प्रतिलिपि \n" +
                "६)वसाई सराइ आएको हकमा बसाइसराइको प्रतिलिपि \n" +
                "७)हक्दार्हरुको पासपोर्ट साइजको फोटो ४ प्रति \n" +
                "८)स्थानीय सर्जमिन मुचुल्का \n" +
                "९) आवस्यकता अनुसार स्थानीय प्रहरी सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४)  तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) आवश्यकता अनुसार स्थानीय प्रहरी सर्जमिन तयार गर्ने \n" +
                "६) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "७) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "घर बाटो प्रमाणित ", "१)निवेदन(बाटोको नाम, टोलसमेत खुलाउने   ) पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" +
                "३)जग्गा रहेको क्षेत्रको प्रमाणित सक्कली नापी नक्शा \n" +
                "४)  चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "५)लिने दिने दुवै व्यक्तिको नागरिकताको प्रमाणपत्रको प्रमाणित प्रतिलिपि सहित उपस्थित हुनुपर्ने वा निजले दिएको आधिकृत वारेसको  प्रमाणित प्रतिलिपि \n" +
                "६)स्थलगत निरिक्षण प्रतिवेदन   \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "प्रति कित्ता रु. ५००- "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "चार किल्ला प्रमाणित ", "१)निवेदनपत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" +
                "३)जग्गा रहेको क्षेत्रको प्रमाणित सक्कली नापी नक्शा \n" +
                "४)  चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "५) निवेदक स्वयं वा निजले अन्य व्यक्ति तोकेको हकमा निजले  दिएको आधिकृत वारेसको  प्रमाणित प्रतिलिपि \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जन्म मिति प्रमाणित ", "१)निवेदनपत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) नाबालकको हकमा जन्म दर्ता  प्रमाणित प्रतिलिपि\n" +
                "३)बसाइ सरि आएको भए सो को प्रमाणपत्र  \n" +
                "४)  चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५०"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "विवाह प्रमाणित ", "१)दुलाह दुलहीको नागरिकता प्रमाणपत्रको प्रतिलिपि \n" +
                "२) वसाई सराइ आएको हकमा बसाइसराइको प्रतिलिपि\n" +
                "३) दुलाह दुलही दुवै उपस्थित भइ सनाखत गर्नु पर्ने \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "५) वि.सं. २०३४ पछिको हकमा विवाह दर्ता प्रमाण पत्रको प्रतिलिपि  \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५०"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "घर पाताल प्रमाणित ", "१)निवेदनपत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) घरको नक्सा, नक्सा पास प्रमाण पत्र     \n" +
                "३)स्थलगत निरिक्षण प्रतिवेदन  \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "५) आवस्यकता अनुसार सर्जमिन मुचुल्का  \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "कागज /मंजुरिनामा प्रमाणित ", "१)निवेदनपत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२)चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "३) प्रमाणित गर्नु पर्ने विषय संग सम्बन्धित प्रमाण कागजहरुको प्रतिलिपि \n" +
                "४)मंजुरिनामा लिने र दिने दुवै व्यक्ति \n", "१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "हकवाला वा हकदार प्रमाणित ", "१)निवेदनपत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) नाता प्रमाणित प्रमाण पत्रको प्रतिलिपि \n" +
                "३) हकदार प्रमाणितका लागि स्थलगत सर्जमिन कागज \n" +
                "४) हकदार प्रमाणित गर्ने थप प्रमाण    \n" +
                "५) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "६) आवस्यकता अनुसार सर्जमिन मुचुल्का \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. १०००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "अविवाहित प्रमाणित ", "१)निवेदनपत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२)सम्रक्षक वा अभिभावकले कार्यालयको रहोबरमा गरेको सनाखत पत्र \n" +
                "३) स्थानीय सर्जमिन मुचुल्कको पत्र \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण  भएको कागजात\n" +
                "५)बिदेशमा रहेकाको हकमा विदेशस्थित नेपाली नियोगबाट आएको सिफारिस  \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जग्गा रेखांकनको कार्य /सो कार्यमा रहोबर  ", "१) निबेदन पत्र\n" +
                "२) सम्बन्धित कार्यालयको पत्र\n" +
                "३)प्राविधिक प्रतिवेदन \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));

    }

    public void buildRecyclerView() {
        RecyclerView mRecyclerView = findViewById(R.id.recyclerView);
        mRecyclerView.setHasFixedSize(true);
        RecyclerView.LayoutManager mLayoutManager = new LinearLayoutManager(this);
        ExampleAdapter mAdapter = new ExampleAdapter(mExampleList);

        mRecyclerView.setLayoutManager(mLayoutManager);
        mRecyclerView.setAdapter(mAdapter);

        mAdapter.setOnItemClickListener(new ExampleAdapter.OnItemClickListener() {
            @Override
            public void onItemClick(int position) {
                Intent intent = new Intent(PradigitActivity.this, DetailsChater.class);
                intent.putExtra("Example Item", mExampleList.get(position));

                startActivity(intent);
            }
        });
    }
    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        if (item.getItemId()==android.R.id.home);
        finish();
        return super.onOptionsItemSelected(item);
    }
}