package com.pokhara.lekhnath.Chater;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.MenuItem;


import com.pokhara.lekhnath.R;

import java.util.ArrayList;

public class Sifaris extends AppCompatActivity {

    private ArrayList<ExampleItem> mExampleList;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_sifaris);
        setTitle(R.string.sifaris);
        if(getSupportActionBar()!=null){
            getSupportActionBar().setDisplayHomeAsUpEnabled(true);
            getSupportActionBar().setDisplayShowHomeEnabled(true);
        }
        createExampleList();
        buildRecyclerView();

    }
    public void createExampleList() {
        mExampleList = new ArrayList<>();

        mExampleList.add(new ExampleItem(R.drawable.nepal, "घर जग्गा नामसारी सिफारिस ", "१)घर जग्गा नामसारी सम्बन्धि विस्तृत विवरण खुलेको निवेदन\n" +
                "२) निवेदकको नागरिकता प्रमाणपत्रको प्रतिलिपि \n" +
                "३) मृतक र निवेदक बिचको नाता प्रमाणित प्रमाणपत्रको प्रतिलिपि \n" +
                "४) जग्गा धनि प्रमाण पुर्जाको प्रतिलिपि \n" +
                "५) सर्जमिन मुचुल्का गरि बुझ्नु पर्ने भए सर्जमिनमा साक्षि बस्नेको नागरिकता प्रमाण पत्रको प्रतिलिपि \n" +
                "६) चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद      \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने \n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने \n" +
                "३) निबेदन दर्ता गर्ने \n" +
                "४) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने \n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने \n" +
                "७) कानुनी जटिलता भएको देखिएमा कानुनी राय लिईनेछ  \n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन   \n", "रु. ३०० "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "मोही लागत कट्टा सिफारिस ", "१)मोही लागत कट्टा हुनुपर्ने पूर्ण विवरणको नेवेदन \n" +
                "२)निवेदकको नागरिकता प्रमाणपत्रको प्रतिलिपि  \n" +
                "३)जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि \n" +
                "४)जग्गाको प्रमाणित नापी नक्शा \n" +
                "५)चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद \n" +
                "६)जग्गाको श्रेस्ता र फिल्डबुकको प्रमाणित प्रतिलिपि      \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने \n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ३०० "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "घर कायम सिफारिस ", "१)घर कायम सिफारिस पाउ: भन्ने सम्बन्धि निवेदन\n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि \n" +
                "३) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि \n" +
                "४)स्थलगत प्रतिवेदन \n" +
                "५) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३)प्राबिधिक  कर्मचारीबाट निरिक्षण गरी प्रतिवेदन दिने \n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने \n" +
                " \n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ३०० "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "छात्रवृत्ति सिफारिस ", "१)निबेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२)घर भएमा चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "३) शैक्षिक योग्यताको प्रमाणपत्रको प्रतिलिपि   \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने \n" +
                "\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "विपन्न विद्यार्थी छात्रवृत्ति सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२ ) शैक्षिक योग्यताको प्रमाणपत्रको प्रतिलिपि   \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४)  तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","नि:शुल्क "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "अपाङ्ग सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) कुन प्रकारको शारिक अपाङ्गता हो सो सम्बन्धित मेडिकल सुपेरीटेन्डेन्टको सिफारिस \n" +
                "३)व्यक्ति स्वंय उपस्थित हुनुपर्ने वा सम्बन्धित कर्मचारीको प्रतिवेदन   \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४)  तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","नि:शुल्क "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "आस्थाई बसोबास सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि र वसोवास गर्ने घर नं. टोल मार्ग वा बाटोको नाम \n" +
                "२) वाहालमा  बसेको भए घरधनीको सनाखत मुचुल्का र निजको नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "३) कर्मचारीको हकमा हाल कार्यरत  रहेको कार्यालयको पत्र \n" +
                "४)घरवहाल तिरेको रसिद\n" +
                "५) घरवहालाको  सम्झौता पत्र \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "स्थाई बसोबास  सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) बसाइँ सराइको हकमा बसाइँ सराइ दर्ता प्रमाण पत्रको प्रतिलिपि \n" +
                "३) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "४) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "नागरिकता प्रतिलिपि सिफारिस", "१)निवेदन पत्र र आमा / बुबाको  नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२)जन्मदर्ता प्रमाण पत्रको प्रतिलिपि \n" +
                "३) बीवाहित महिलाको हकमा पति/आमा/बुवाको   नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "४) चारित्रिक प्रमाणपत्रको प्रतिलिपि (बिध्यार्थिको हकमा )\n" +
                "५)विवाह दर्ता प्रमाणपत्रको प्रतिलिपि (विवाहितको हकमा)\n" +
                "६) वसाई सरि आएको हकमा बसाइ सराईको प्रमाणपत्रको प्रतिलिपि\n" +
                "७) दुवै कान देखिने पासपोर्ट साइजको फोटो २ प्रति \n" +
                "८) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "९)कर्मचारीको हकमा हाल कार्यरत  रहेको कार्यालयको सिफारिस \n" +
                "१०) प्रतिलिपि नागरिकताको हकमा पुरानो नागरिकताको प्रतिलिपि  \n" +
                "\n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" +
                "७) तोकिएको ढाचामा नागरिकता सिफारिसको अभिलेख राख्ने \n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. २५"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "अंगिकृत नागरिकता सिफारिस" , "१)निवेदन पत्र र अंगिकृत नागरिकाता प्राप्त गर्न खोजेको स्पस्ट आधार \n" +
                "२)साविक मुलुकको नागारिकता परित्याग गरेको वा परित्याग गर्न कारवाही चलाएको पुस्टि गर्ने कागजात हरु \n" +
                "३) नेपालमा १५ वर्षदेखि कुनै व्यवसाय या काम गरि वसेको प्रमाणपत्रको प्रतिलिपि \n" +
                "४) बैवाहिक अंगिकृत नागरिकताको लागि विवाह दर्ता प्रतिलिपिपर  सम्बन्धित देशको आधिकारिक प्रमाणपत्र \n" +
                "५)नेपाली भाषा लेख्न र बोल्न जान्ने प्रमाण कागजातहरु \n" +
                "६) पासपोर्ट साइजको फोटो ३  प्रति  \n" +
                "७) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "८) सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" +
                "७) अनुसूची ८ को ढाचामा नागारिकता सिफारिसको अभिलेख राख्ने   \n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "विद्युत जडान सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" +
                "३) हक भोगेको श्रोत खुल्ने कागज \n" +
                "४) नक्शा पास वा नामसारी नक्शा भएको प्रमाणको प्रतिलिपि \n" +
                "५) अन्य आवश्यक कागजातहरु \n" +
                "६) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु.१५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "धारा जडान सिफारिस ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) नक्शा पास वा नामसारी नक्शा भएको प्रमाणको प्रतिलिपि \n" +
                "३) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु.१५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जिवित रहेको सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) व्यक्ति स्वंय उपस्थित हुनुपर्ने\n" +
                "३) पासपोर्ट साइजको फोटो २  प्रति \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु.१०००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "दुवै नाम गरेको व्यक्ति एकै हो भन्ने सिफारिस फरक जन्ममिति संसोधन सिफारिस  ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) नाम फरक परेको पुस्टि गर्ने प्रमाणित कागजातहरु \n" +
                "३) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "४)सम्बन्धित व्यक्ति वा हकवाला उपस्थित भइ सनाखत गर्नु पर्ने \n" +
                "५) आवश्यकता अनुसार स्थानीय प्रहरी सर्जमिन मुचुल्का माग गर्न सक्ने \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जग्गा मुल्यांकन सिफारिस/प्रमाणित ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n" +
                "३)जग्गाको आपसको चलन चल्तीको मूल्य प्रक्षेपण \n" +
                "४) हालसालै आसपासको खरिद बिक्रि भएको भए सो प्रमाण पत्र वा सर्जमिन मुचुल्का \n" +
                "५)  चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","प्रति हजार रु.१"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "कोर्ट फि मिनाहा सिफारिस", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) आफ्नै घर भएमा चालु आ. व. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "३) अदालतमा मुद्दा परेको प्रमाण कागजातहरु \n" +
                "४) कोट फि मिनाहा हुनु पर्ने स्पष्ट कारण लिखित रुपमा दिनुपर्ने \n" +
                "५) स्थानीय सर्जमिनका मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","नि:शुल्क "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "नावालक परिचयपत्र सिफारिस  ", "१)बुवा आमाको  नागरिकता प्रमाणपत्रको प्रतिलिपि र निवेदन पत्र \n" +
                "२) जन्म दर्ताको प्रमाणपत्र \n" +
                "३)चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "४) नाबालक खुल्ने थप कुनै प्रमाण कागजात भए सो समेत पेश गर्ने \n" +
                "५) नाबालक अनिवार्य उपस्थित हुनु पर्ने \n" +
                "६) दुवै कान देखिने पासपोर्ट साइजको फोटो \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "५) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. २५ "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "चौपाया सम्बन्धि सिफारिस ", "१)कारण सहितको  निवेदन \n" +
                "२) चौपाय लाने ठाउको स्वीकृत पत्र  \n" +
                "३)लिने दिने दुबैले सनाखत गर्नु पर्ने \n" +
                "४) चौपायपालन गर्नेको हकम स्थान र छरछिमेक तथा वातावरणमा प्रतिकुल असर नपर्ने व्यहोरा  \n" +
                "\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"    ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","रु. ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "व्यक्तिगत विवरण सिफारिस", "१)निवेदन पत्र \n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "३) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "४) विषय संग सम्बन्धित अन्य प्रमाण कागजात \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "विद्यालय संचालन स्वीकृत / कक्षा बृदि  सिफारिस", "१) विद्यालय कक्षा बृदिका लागि निवेदन  \n" +
                "२) विद्यालय दर्ता प्रमाणपत्रको प्रतिलिपी \n" +
                "३) स्थानीय तहको नामको नविकरण सहितको व्यवसाय दर्ता  प्रमाण पत्र \n" +
                "४)(सरकारी एबं सामुदायिक बिद्यालय बाहेक अन्य मा )चालु आ. वा. सम्मको मालपोत र घर जग्गा कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "५) बहालमा भए सम्झौता पत्र को प्रतिलिपि र बहाल कर तिरेको रसिद नतिरेको भए तिर्न बुझाउन पर्ने \n" +
                "६) स्थायी लेखा नंबर प्रमाण पत्रको प्रतिलिपि  \n" +
                "७) निरिक्षण प्रतिवेदन\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n","समुदायिक निशुल्क\n" +
                "संस्थागत : आधारभूत\n" +
                "रु. १५,०००-\n" +
                "माध्यमिक \n" +
                "रु. २०,०००- "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जग्गा दर्ता सिफारिस ", "१)निवेदन पत्र \n" +
                "२) नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "३) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात\n" +
                "४) साविक लागत प्रमाणित प्रतिलिपि\n" +
                "५)फिल्ड बूक उतार \n" +
                "६) स्थलगत निरिक्षण प्रतिवेदन \n" +
                "७)जगाको नापी नक्शा \n" +
                "८) जग्गा संग सम्बन्धित अन्य प्रमाण कागजात \n" +
                "९) स्थानीय सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "प्रति रोपनी रु. २५०० "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "संरक्षक सिफारिस (व्यक्तिगत)" , "१) निवेदन\n" +
                "२)संरक्षक दिने र लिने व्यक्तिको  नागरिकता / जन्मदर्ता प्रमाणपत्रको प्रतिलिपि\n" +
                "३) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "४) आवस्यकता अनुसार स्थलगत सर्जमिन मुचुल्का \n" +
                "५) स्थानीय सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "संरक्षक सिफारिस (संस्थागत)", "१) निवेदन\n" +
                "२)संस्था नबिकरण सहितको प्रमाणपत्रको प्रतिलिपि वा नियमावलीको  प्रतिलिपि\n" +
                "३) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "४) बहालमा भए सम्झौता पत्र को प्रतिलिपि र बहाल कर तिरेको रसिद नतिरेको भए तिर्न बुझाउन पर्ने\n" +
                "५) आवस्यकता अनुसार सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. १०००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "नेपाल सरकारको नाममा बाटो कायम सिफारिस ", "१)निवेदन \n" +
                "२)जग्गाधनीको   प्रमाणपत्रको प्रतिलिपि \n" +
                "३)नापी नक्शा \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "५) जग्गा धनीको स्वीकृतिको सनाखत गर्नुपर्ने \n" +
                "६)जागा धनीले सनाखत गरेको कागजात \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n","वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "कोठा खोल्ने कार्य/ रहोवरमा बस्ने कार्य", "१) कारण प्रस्ट खुलेको निवेदन पत्र \n" +
                "२)चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद वा कर निर्धारण स्वीकृत भएको कागजात \n" +
                "३) बहाल सम्झौताको प्रमाणित प्रतिलिपि\n" +
                "४)जिल्ल प्रशासंकार्यलायाको पत्र  \n" +
                "५)स्थानीय सर्जमिन मुचुल्का \n" +
                "६) आवस्यकता अनुसार स्थानीय प्रहरी सर्जमिन मुचुल्का \n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) रहोवरमा बस्ने कर्मचारी तोक्ने\n" +
                " ६) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "७) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "नि: शुल्क वा स: शुल्क स्वास्थ्स उपचार सिफारिस " , "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) आर्थिक अवस्था कमजोर भएको पुष्टि हुने कागजात\n" +
                "३) सिफारिस आवश्यक भएको अन्य कारण \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "नि:शुल्क "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "अन्य कार्यालयको माग अनुसार विवरण खुलाई पठाउने कार्य ", "१)निवेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२) कार्यालयको पत्र \n" +
                "३) विषय संग सम्बन्धित अन्य कागजात \n",""," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु.  ३००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "जग्गाधनि पुर्जा हराएको सिफारिस ", "१) निबेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि \n" +
                "२) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद \n" +
                "३) जग्गा धनि प्रमाण पुर्जाको प्रतिलिपि \n" +
                "४)निवेदकको स्थाई बाटाह जागा रहेको वडाको नभएमा स्थानीय सर्जमिन मुचुल्का \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "पुर्जामा घर कायम गर्ने सिफारिस", "१) निबेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि \n" +
                "२) भवन नक्सा पास प्रमाणपत्रको प्रतिलिपि \n" +
                "३) निर्माण सम्पन्न प्रमाणपत्रको प्रतिलिपि \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद \n" +
                "५) जग्गाधनी प्रमाण पुर्जाको प्रमाणित प्रतिलिपि\n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n"," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ५००"));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "अंग्रेजी सिफारिस तथा प्रमाणित ", "१)निबेदन पत्र र नागरिकता प्रमाणपत्रको प्रतिलिपि\n" +
                "२)घर भएमा चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" +
                "३)विषय संग सम्बन्धित  प्रमाणपत्रको प्रतिलिपि   \n","१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ," वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", "रु. ६०० "));
        mExampleList.add(new ExampleItem(R.drawable.nepal, "उल्लेखित बाहेक अन्य स्थानीय आवश्यकता अनुसारका सिफारिस /प्रमाणितहरु", "१)निवेदन पत्र \n" +
                "२)नागरिकता प्रमाणपत्रको प्रमाणित प्रतिलिपि \n" +
                "३) बिषयसंग  सम्बन्धित प्रमाण कागजात \n" +
                "४) चालु आ.व. सम्मको मालपोत र घर जग्गा  कर वा एकीकृत सम्पत्ति कर तिरेको रसिद\n" ,"१) निवेदन सहितको तोकिएको कागजातहरु पेश गर्ने\n" +
                "२) वडा अध्यक्ष/सदस्य/सचिबले सम्बन्धित कर्मचारीलाई तोक आदेश गर्ने\n" +
                "३) निबेदन दर्ता गर्ने\n" +
                "४) ) तोकिएको कर्मचारीले आवश्यकता अनुसार सर्जमिन मुचुल्का  तयार गरि सिफारिस तयार गर्ने\n" +
                "५) निवेदकले तोकिएको शुल्क बुझाउने \n" +
                "६) चलानी गरि निवेदकलाइ सिफारिस उपलब्ध गराउने\n" ,"वडा अध्यक्ष/ सदस्य/ सचिबले सम्बन्धित फाटका कार्मचारी \n" +
                "लाग्ने समय : सोहि दिन \n" +
                "सर्जमिनको हकमा बढीमा ३ दिन  \n", " सिफारिसको प्रकृति अनुसार न्युनतम रु. ३०० "));
    }

    public void buildRecyclerView() {
        RecyclerView mRecyclerView = findViewById(R.id.recyclerView);
        mRecyclerView.setHasFixedSize(true);
        RecyclerView.LayoutManager mLayoutManager = new LinearLayoutManager(this);
        ExampleAdapter mAdapter = new ExampleAdapter(mExampleList);

        mRecyclerView.setLayoutManager(mLayoutManager);
        mRecyclerView.setAdapter(mAdapter);

        mAdapter.setOnItemClickListener(new ExampleAdapter.OnItemClickListener() {
            @Override
            public void onItemClick(int position) {
                Intent intent = new Intent(Sifaris.this, DetailsChater.class);
                intent.putExtra("Example Item", mExampleList.get(position));

                startActivity(intent);
            }
        });
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        if (item.getItemId()==android.R.id.home);
        finish();
        return super.onOptionsItemSelected(item);
    }
}